cool/tutorials/heatTransfer/buoyantBoussinesqSimpleFoam/iglooWithFridges/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    ground
    {
        type            buoyantPressure;
        rho             rhok;
        value           uniform 0;
    }

    igloo_region0
    {
        type            buoyantPressure;
        rho             rhok;
        value           uniform 0;
    }

    twoFridgeFreezers_seal_0
    {
        type            buoyantPressure;
        rho             rhok;
        value           uniform 0;
    }

    twoFridgeFreezers_herring_1
    {
        type            buoyantPressure;
        rho             rhok;
        value           uniform 0;
    }
}

// ************************************************************************* //
